Spoke: smss-dogs-backup, Environment: dev and Pipeline Stage: dev
```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_backup_policy_vm.policy["daily-backup-policy-dogs"] will be created
  + resource "azurerm_backup_policy_vm" "policy" {
      + id                             = (known after apply)
      + instant_restore_retention_days = (known after apply)
      + name                           = "daily-backup-policy-dogs"
      + policy_type                    = "V2"
      + recovery_vault_name            = "rsv-smss-core-001"
      + resource_group_name            = "rg-smss-core-001"
      + timezone                       = "UTC"

      + backup {
          + frequency = "Daily"
          + time      = "20:00"
        }

      + retention_daily {
          + count = 14
        }
    }

  # azurerm_backup_policy_vm_workload.backup_workload_policies["dogssqlbackup01"] will be created
  + resource "azurerm_backup_policy_vm_workload" "backup_workload_policies" {
      + id                  = (known after apply)
      + name                = "dogssqlbackup01"
      + recovery_vault_name = "rsv-smss-core-001"
      + resource_group_name = "rg-smss-core-001"
      + workload_type       = "SQLDataBase"

      + protection_policy {
          + policy_type = "Log"

          + backup {
              + frequency_in_minutes = 15
              + weekdays             = []
            }

          + simple_retention {
              + count = 8
            }
        }
      + protection_policy {
          + policy_type = "Full"

          + backup {
              + frequency = "Daily"
              + time      = "22:00"
              + weekdays  = []
            }

          + retention_daily {
              + count = 8
            }
        }

      + settings {
          + compression_enabled = false
          + time_zone           = "UTC"
        }
    }

  # azurerm_backup_protected_vm.vm["vm-dogs-app01"] will be created
  + resource "azurerm_backup_protected_vm" "vm" {
      + backup_policy_id    = (known after apply)
      + id                  = (known after apply)
      + protection_state    = (known after apply)
      + recovery_vault_name = "rsv-smss-core-001"
      + resource_group_name = "rg-smss-core-001"
      + source_vm_id        = "/subscriptions/1694d62a-08ca-48d5-93b6-0feb07d8bce3/resourceGroups/rg-smss-dogs-001/providers/Microsoft.Compute/virtualMachines/vm-dogs-app01"
    }

  # azurerm_backup_protected_vm.vm["vm-dogs-sql01"] will be created
  + resource "azurerm_backup_protected_vm" "vm" {
      + backup_policy_id    = (known after apply)
      + id                  = (known after apply)
      + protection_state    = (known after apply)
      + recovery_vault_name = "rsv-smss-core-001"
      + resource_group_name = "rg-smss-core-001"
      + source_vm_id        = "/subscriptions/1694d62a-08ca-48d5-93b6-0feb07d8bce3/resourceGroups/rg-smss-dogs-001/providers/Microsoft.Compute/virtualMachines/vm-dogs-sql01"
    }

Plan: 4 to add, 0 to change, 0 to destroy.